
  export const questions = [
    {
      title: 'React - это ... ?',
      variants: ['библиотека', 'фреймворк', 'приложение'],
      correct: 0,
    },
    {
      title: 'Компонент - это ... ',
      variants: ['приложение', 'часть приложения или страницы', 'что-то сложное'],
      correct: 1,
    },
    {
      title: 'Что такое JSX?',
      variants: [
        'Это простой HTML',
        'Это функция',
        'Это тот же HTML, но с возможностью выполнять JS-код',
      ],
      correct: 2,
    },
    {
      title: 'Основная философия React?',
      variants: [
        'С самого начала иметь какой то план',
        'Переиспользование компонентов',
        'Не убей',
      ],
      correct: 1,
    },
    {
      title: 'Какую React решает проблему?',
      variants: [
        'Любую',
        'Все, кроме личных',
        'Манипулирования DOM элементами',
      ],
      correct: 2,
    },
  ]
  







